#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_filter.countries will be created
  + resource "cloudflare_filter" "countries" {
      + description = "Expression to block all countries except ;)"
      + expression  = (sensitive)
      + id          = (known after apply)
      + zone_id     = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_firewall_rule.countries will be created
  + resource "cloudflare_firewall_rule" "countries" {
      + action      = "block"
      + description = "Firewall rule to block all countries except ;)"
      + filter_id   = (known after apply)
      + id          = (known after apply)
      + zone_id     = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_record.ipv4 will be created
  + resource "cloudflare_record" "ipv4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ipv4"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "20.168.48.0"
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive)
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = "6dbf018cb5f882a1e74d770fe5676aa8"
    }

  # cloudflare_zone_settings_override.cloudflare_settings will be created
  + resource "cloudflare_zone_settings_override" "cloudflare_settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "6dbf018cb5f882a1e74d770fe5676aa8"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = "off"
          + always_use_https            = "on"
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = (known after apply)
          + browser_check               = "on"
          + cache_level                 = (known after apply)
          + challenge_ttl               = 1800
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = "on"
          + early_hints                 = (known after apply)
          + email_obfuscation           = "on"
          + filter_logs_to_cloudflare   = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = "on"
          + http2                       = (known after apply)
          + http3                       = "on"
          + image_resizing              = (known after apply)
          + ip_geolocation              = "on"
          + ipv6                        = "off"
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = "on"
          + opportunistic_onion         = "on"
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = "2"
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = "on"
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = "off"
          + response_buffering          = (known after apply)
          + rocket_loader               = "on"
          + security_level              = "medium"
          + server_side_exclude         = "off"
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "strict"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = "zrt"
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = "on"
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = "off"
          + zero_rtt                    = "on"

          + minify {
              + css  = "on"
              + html = "on"
              + js   = "on"
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = false
              + include_subdomains = (known after apply)
              + max_age            = (known after apply)
              + nosniff            = (known after apply)
              + preload            = (known after apply)
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`*